[
    {
        "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
        "title": "WhatsApp",
        "purpose": "Messaging & calls",
        "companyName": "Meta Platforms, Inc.",
        "id": 1,
        "description": "WhatsApp is a globally recognized messaging platform that seamlessly connects people from all corners of the world. Beyond simple text messaging, it allows users to send voice messages, high-resolution images, videos, documents, and even locations in real-time. Group chats support hundreds of participants, making it perfect for family, friends, and professional teams alike. End-to-end encryption ensures all communications are private and secure, while voice and video calls maintain high clarity across devices. The app also integrates features like status updates, QR code contacts, and WhatsApp Web for desktop use, providing a flexible experience for both personal and professional purposes. Its intuitive interface and lightweight performance ensure that users can stay connected efficiently, whether on high-speed networks or limited connections. WhatsApp has become more than a messaging app—it is a versatile communication ecosystem trusted by billions every day.",
        "size": 200,
        "reviews": "500M",
        "ratingAvg": 4.8,
        "downloads": "5B",
        "ratings": [
            {
                "name": "1 star",
                "count": 5000000
            },
            {
                "name": "2 star",
                "count": 2000000
            },
            {
                "name": "3 star",
                "count": 10000000
            },
            {
                "name": "4 star",
                "count": 100000000
            },
            {
                "name": "5 star",
                "count": 400000000
            }
        ]
    },
    {
        "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
        "title": "Facebook",
        "purpose": "Social networking",
        "companyName": "Meta Platforms, Inc.",
        "id": 2,
        "description": "Facebook is a leading social networking platform designed to bring people together across the globe. Users can share life moments through posts, photos, and videos, engage in discussions via comments and reactions, and stay informed through News Feed updates tailored to their interests. Facebook Groups allow communities to form around common passions, hobbies, or professional goals, while Pages enable brands, celebrities, and organizations to interact with their audiences directly. Marketplace provides a secure and convenient environment for buying and selling items, while Events lets users organize and RSVP to social gatherings seamlessly. With continuous innovations like live streaming, polls, story features, and integrated messaging through Messenger, Facebook provides a comprehensive digital ecosystem that blends social connection, entertainment, and commerce for billions of users worldwide.",
        "size": 250,
        "reviews": "110M",
        "ratingAvg": 4.3,
        "downloads": "1B",
        "ratings": [
            {
                "name": "1 star",
                "count": 10000000
            },
            {
                "name": "2 star",
                "count": 5000000
            },
            {
                "name": "3 star",
                "count": 20000000
            },
            {
                "name": "4 star",
                "count": 300000000
            },
            {
                "name": "5 star",
                "count": 700000000
            }
        ]
    },
    {
        "image": "https://upload.wikimedia.org/wikipedia/commons/9/95/Instagram_logo_2022.svg",
        "title": "Instagram",
        "purpose": "Photo & video sharing",
        "companyName": "Meta Platforms, Inc.",
        "id": 3,
        "description": "Instagram is a highly visual social media platform that empowers users to share their stories through photos and videos. From posting on the main feed to creating ephemeral Stories or engaging short-form content via Reels, Instagram offers a diverse suite of tools for personal expression and brand promotion. The platform includes filters, editing tools, and augmented reality effects to enhance content creatively, while features like direct messaging, comments, and likes foster engagement. Instagram also integrates shopping features, enabling users to explore products, make purchases directly, and follow their favorite brands. Its algorithm-driven Explore page ensures personalized content discovery, helping users connect with new creators, trends, and communities. With its blend of aesthetics, interactivity, and discoverability, Instagram remains a go-to platform for influencer's, businesses, and casual users alike.",
        "size": 150,
        "reviews": "40M",
        "ratingAvg": 4.5,
        "downloads": "80M",
        "ratings": [
            {
                "name": "1 star",
                "count": 8000000
            },
            {
                "name": "2 star",
                "count": 4000000
            },
            {
                "name": "3 star",
                "count": 16000000
            },
            {
                "name": "4 star",
                "count": 240000000
            },
            {
                "name": "5 star",
                "count": 560000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/27Hx5CT4/tiktok-logo-tikok-icon-transparent-tikok-app-logo-free-png.webp",
        "title": "TikTok",
        "purpose": "Short videos",
        "companyName": "ByteDance",
        "id": 4,
        "description": "TikTok is an innovative short-video platform that combines entertainment, creativity, and social interaction in a highly engaging experience. Users can create videos ranging from 15 seconds to several minutes, using a rich library of music, sound effects, and visual filters. Features such as duets, stitches, and collaborative challenges encourage interaction, creativity, and viral content creation. TikTok’s recommendation algorithm analyzes user behavior to provide a personalized feed that keeps viewers captivated, while the platform also supports live streaming and community engagement. Beyond entertainment, TikTok has become a hub for learning, tutorials, product reviews, and brand marketing. With its global reach, TikTok allows users to express themselves, connect with audiences worldwide, and discover trends in an engaging, interactive environment.",
        "size": 300,
        "reviews": "120M",
        "ratingAvg": 4.6,
        "downloads": "1.2B",
        "ratings": [
            {
                "name": "1 star",
                "count": 12000000
            },
            {
                "name": "2 star",
                "count": 6000000
            },
            {
                "name": "3 star",
                "count": 24000000
            },
            {
                "name": "4 star",
                "count": 360000000
            },
            {
                "name": "5 star",
                "count": 840000000
            }
        ]
    },
    {
        "image": "https://upload.wikimedia.org/wikipedia/commons/4/42/YouTube_icon_%282013-2017%29.png",
        "title": "YouTube",
        "purpose": "Video streaming",
        "companyName": "Google LLC",
        "id": 5,
        "description": "YouTube is the world’s leading video-sharing platform, offering users access to a vast array of content ranging from tutorials and music videos to live streams and vlogs. Users can upload, watch, and engage with videos, create playlists, and subscribe to channels to stay updated with favorite creators. YouTube provides detailed analytics to creators, helping them understand audience engagement, demographics, and content performance. Premium subscriptions offer ad-free viewing, offline downloads, and access to YouTube Music. With features like community posts, live chats, premieres, and stories, YouTube has evolved into a versatile platform for entertainment, education, and communication. Whether you’re a content creator aiming to grow your audience or a viewer seeking informative or entertaining content, YouTube provides a complete ecosystem for digital video experiences.",
        "size": 250,
        "reviews": "100M",
        "ratingAvg": 4.7,
        "downloads": "1B",
        "ratings": [
            {
                "name": "1 star",
                "count": 10000000
            },
            {
                "name": "2 star",
                "count": 5000000
            },
            {
                "name": "3 star",
                "count": 20000000
            },
            {
                "name": "4 star",
                "count": 300000000
            },
            {
                "name": "5 star",
                "count": 700000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/8492dyv6/67767f942c4928d932dc4f37-67767e2671f2ed8d606a3302-Icon.jpg",
        "title": "Snapchat",
        "purpose": "Ephemeral messaging",
        "companyName": "Snap Inc.",
        "id": 6,
        "description": "Snapchat is a multimedia messaging app developed by Snap Inc. It allows users to send photos and videos that disappear after being viewed. Snapchat also features Stories, Discover for curated content, and various filters and lenses for enhancing photos and videos.Snapchat is a creative messaging platform that allows users to share photos, videos, and text that disappear after being viewed. Its core feature, Stories, allows users to chronicle their day-to-day life, which disappears after 24 hours. Snapchat also offers interactive AR lenses, filters, and Bitmoji integration to make communication fun and engaging. Discover provides curated content from publishers, creators, and influencers, while Snap Map allows sharing locations and exploring friends’ activities around the world. With ephemeral messaging, streaks, and gamified features, Snapchat encourages regular engagement while maintaining privacy. It has become a favorite platform for younger audiences seeking interactive, real-time social experiences combined with creative expression.",
        "size": 150,
        "reviews": "50M",
        "ratingAvg": 4.4,
        "downloads": "60M",
        "ratings": [
            {
                "name": "1 star",
                "count": 6000000
            },
            {
                "name": "2 star",
                "count": 3000000
            },
            {
                "name": "3 star",
                "count": 12000000
            },
            {
                "name": "4 star",
                "count": 180000000
            },
            {
                "name": "5 star",
                "count": 420000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/BHqGvbhr/download.png",
        "companyName": "X Corp.",
        "title": "X (Twitter)",
        "purpose": "Microblogging",
        "id": 7,
        "description": "X, formerly known as Twitter, is a social media platform for real-time communication. X, formerly known as Twitter, is a real-time social media platform that empowers users to share thoughts, news, and multimedia content quickly and efficiently. Users post tweets, which can contain text, images, videos, polls, or links, and engage with others through retweets, likes, replies, and threads. Hashtags and trending topics enable content discovery and participation in global conversations. X also offers Spaces for live audio discussions and Communities to connect users around shared interests. Widely used by individuals, journalists, brands, and public figures, X is both a news source and a platform for opinion-sharing, providing immediate access to global trends and conversations in an interactive format.",
        "size": 100,
        "reviews": "250M",
        "ratingAvg": 4.2,
        "downloads": "500M",
        "ratings": [
            {
                "name": "1 star",
                "count": 5000000
            },
            {
                "name": "2 star",
                "count": 2000000
            },
            {
                "name": "3 star",
                "count": 10000000
            },
            {
                "name": "4 star",
                "count": 150000000
            },
            {
                "name": "5 star",
                "count": 340000000
            }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Q3Rx4j27/telegram-icon-vector-511451-46.jpg",
        "title": "Telegram",
        "purpose": "Secure messaging",
        "companyName": "Telegram Messenger LLP",
        "id": 8,
        "description": "Telegram is a cloud-based messaging app designed for speed, security, and flexibility. Users can send text messages, photos, videos, and files of unlimited size, create large group chats, and broadcast messages via channels. Telegram emphasizes privacy with end-to-end encryption for secret chats and advanced security features. Bots, custom themes, and automation tools allow users to enhance productivity and interaction. Telegram’s interface is lightweight, fast, and supports multiple devices simultaneously. With its focus on privacy, extensive features, and community engagement, Telegram has become a preferred messaging platform for personal communication, professional groups, and large communities alike.",
        "size": 150,
        "reviews": "400M",
        "ratingAvg": 4.6,
        "downloads": "400M",
        "ratings": [
            {
                "name": "1 star",
                "count": 4000000
            },
            {
                "name": "2 star",
                "count": 2000000
            },
            {
                "name": "3 star",
                "count": 8000000
            },
            {
                "name": "4 star",
                "count": 120000000
            },
            {
                "name": "5 star",
                "count": 280000000
            }
        ]
    }
]